tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "openssl@3"
brew "bat"
brew "xz"
brew "btop"
brew "readline"
brew "sqlite"
brew "deno"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "go"
brew "jq"
brew "lazygit"
brew "lua"
brew "neofetch"
brew "neovim"
brew "pinentry-mac"
brew "pyenv"
brew "ripgrep"
brew "tcl-tk"
brew "tmux"
brew "trash"
brew "tree"
brew "watchman"
brew "zig"
brew "zlib"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "font-monaspace"
cask "font-victor-mono"
cask "kitty"
cask "neovide"
cask "wezterm"
